Reports/ОтчетПоПодарочнымКартам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ОтчетПоПодарочнымКартам</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/СоответствиеДатДнямНедели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеДатДнямНедели</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ОтчетПоПодарочнымКартам/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Попытка	
		НачалоПериода = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.Дата;
		КонецПериода = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Значение.Дата;
	Исключение
		Сообщить("Период отчета задан не корректно!");
		Возврат;
	КонецПопытки;	
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	dbo_CheckLine.date_ch КАК ДатаЧека,
		|	dbo_CheckLine.id_tt_cl КАК ТТ,
		|	СУММА(1) КАК Колво,
		|	СУММА(dbo_CheckLine.BasePrice) КАК Сумма
		|ИЗ
		|	ВнешнийИсточникДанных.SMS_Izbenka.Таблица.dbo_CheckLine КАК dbo_CheckLine
		|ГДЕ
		|	dbo_CheckLine.id_tov_cl = 1113
		|	И dbo_CheckLine.OperationType_cl = 1
		|	И dbo_CheckLine.BasePrice > 0
		|	И dbo_CheckLine.id_tt_cl > 0
		|	И dbo_CheckLine.date_ch МЕЖДУ &НачалоПериода И &КонецПериода
		|	И 1 = 1
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_CheckLine.date_ch,
		|	dbo_CheckLine.id_tt_cl";

	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);

	тз1 = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	dbo_CheckLine.date_ch КАК ДатаЧека,
		|	dbo_CheckLine.id_tt_cl КАК ТТ,
		|	СУММА(1) КАК Колво,
		|	СУММА(dbo_CheckLine.BasePrice) КАК Сумма
		|ИЗ
		|	ВнешнийИсточникДанных.SMS_Union.Таблица.dbo_CheckLine КАК dbo_CheckLine
		|ГДЕ
		|	dbo_CheckLine.id_tov_cl = 1113
		|	И dbo_CheckLine.BasePrice > 0
		|	И dbo_CheckLine.id_tt_cl > 0
		|	И dbo_CheckLine.date_ch МЕЖДУ &НачалоПериода И &КонецПериода
		|	И 1 = 1
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_CheckLine.date_ch,
		|	dbo_CheckLine.id_tt_cl";

	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);

	тз2 = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тз1.ДатаЧека КАК ДатаЧека,
		|	тз1.Колво КАК Колво,
		|	тз1.ТТ КАК ТТ,
		|	тз1.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВремТЗ1
		|ИЗ
		|	&тз1 КАК тз1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тз2.ДатаЧека,
		|	тз2.Колво,
		|	тз2.ТТ,
		|	тз2.Сумма
		|ПОМЕСТИТЬ ВремТЗ2
		|ИЗ
		|	&тз2 КАК тз2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ДатаЧека КАК ДатаЧека,
		|	СтруктурныеЕдиницы.Ссылка КАК ТорговаяТочка,
		|	СУММА(ВложенныйЗапрос.Колво) КАК Колво,
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
		|	СоответствиеДатДнямНедели.НомерНедели КАК Неделя,
		|	""                   "" КАК Месяц,
		|	ВложенныйЗапрос.ТТ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВремТЗ1.ДатаЧека КАК ДатаЧека,
		|		ВремТЗ1.Колво КАК Колво,
		|		ВремТЗ1.ТТ КАК ТТ,
		|		ВремТЗ1.Сумма КАК Сумма
		|	ИЗ
		|		ВремТЗ1 КАК ВремТЗ1
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВремТЗ2.ДатаЧека,
		|		СУММА(ВремТЗ2.Колво),
		|		ВремТЗ2.ТТ,
		|		СУММА(ВремТЗ2.Сумма)
		|	ИЗ
		|		ВремТЗ2 КАК ВремТЗ2
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВремТЗ2.ДатаЧека,
		|		ВремТЗ2.ТТ) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеДатДнямНедели КАК СоответствиеДатДнямНедели
		|		ПО ВложенныйЗапрос.ДатаЧека = СоответствиеДатДнямНедели.Дата
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|		ПО ВложенныйЗапрос.ТТ = СтруктурныеЕдиницы.id_TT
		|
		|СГРУППИРОВАТЬ ПО
		|	СоответствиеДатДнямНедели.НомерНедели,
		|	ВложенныйЗапрос.ДатаЧека,
		|	СтруктурныеЕдиницы.Ссылка,
		|	ВложенныйЗапрос.ТТ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаЧека";
    Запрос.УстановитьПараметр("тз1", тз1);
	Запрос.УстановитьПараметр("тз2", тз2);		
		
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для каждого ТекСтрРез Из ТЗ Цикл
	
		ТекСтрРез.Месяц = Формат(ТекСтрРез.ДатаЧека, "ДФ='ММММ гггг'");
	
	КонецЦикла;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТЗ",ТЗ);
	
	//СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки = КомпоновщикНастроек.Настройки;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,	ВнешниеНаборыДанных,,Истина);
		
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
 	
	
КонецПроцедуры
